# Вариант 8.
# Дано целое число N (>0) и символ C. Вывести строку длины N, которая состоит из символов C.

N = int(input("Введите число N (>0): "))
C = input("Введите символ C: ")

result = C * N
print(result)